# https://docs.google.com/document/d/1ZDKuzUXnKA1ccpwSele_bQwxuWEQUsEiQgHmvtiR7Ms/edit?tab=t.0


'''
План занятий курса по python
9 занятий, 16 тем

Занятие 1. Введение в python, hello world
• Тема 1. Введение в python
• Общая характеристика python
• Установка python
• Установка pycharm
• Первая программа hello world

Занятие 2. Переменная, базовые типы данных
• Тема 2. Переменная
• Что такое переменная?
• Типы переменных
• Подробнее о функции print

• Тема 3. Типы данных
• Типы данных (строки, числа, булевы, None).
• Функции ввода-вывода
• Методы строк

Занятие 3. Условные операторы, циклы
• Тема 4. Условные операторы
• Логический тип данных (True/False)
• Условные операторы, конструкция if-elif-else

• Тема 5. Циклы
• Цикл for
• Цикл while

• Ключевые слова break, continue

Занятие 4. Структуры данных
• Тема 6. Списки, кортежи
• Создание и применения списков, кортежей
• Методы списков
• Генерация списков

• Тема 7. Словари
• Создание словаря, взаимодействия со словарем
• Методы словарей

Занятие 5. Функция (часть 1)
• Тема 8. Основные понятия функции
• Создание и вызов функции
• Параметры функции
• Возвращаемое значение функции
• Локальная и глобальная область видимости функции

Занятие 6. Функция (часть 2)
• Тема 9. Импорт функции
• Как импортировать функцию?
• Встроенные модули

• Тема 10. Продвинутые функции
• Функция как объект
• Лямбда-функция
• Декораторы

Занятие 7. ООП (Часть 1)
• Тема 11. Введение в ООП
• Теоретическое введение в ООП

• Тема 12. Основы ООП в python
• Создание класса и объектов
• Создание атрибутов и методов

Занятие 8. ООП (Часть 1)
• Тема 13. Магические методы, защищенные/приватные атрибуты
• Что такое магический метод?
• Создание защищенных/приватных атрибутов

• Тема 14. Наследование
• Что такое наследование в ООП?
• Переопределение методов
• Базовые классы
Занятие 9. Обработка исключений, работа с файлами.
• Тема 15. Обработка исключений
• Что такое исключение?
• Конструкция try-except

• Тема 16. Файлы, работа с файлами
• Файлы txt, json, pickle и csv. Их предназначение и ключевые отличия
• Способы взаимодействия с файлом
• Взаимодействие с файлом, чтение и запись
'''